Repository: ma12vlad/passger
Catalog: po/*.po
Languages: ru

source: PassGer - A simple password generator
ru: PassGer — генератор паролей

source: Length:
ru: Длина:

source: You can specify the password length using the spin box on the left. You can also specify the type of characters used for each character in the password using the table below. You can select the type of characters from uppercase letters, lowercase letters, numbers, and punctuation characters. You can select or deselect all character types for that column by clicking the column header. Specify at least one type for each row.
ru: Укажите длину пароля в окошке слева. Укажите тип символа используемого для каждого символа пароля с помощью таблицы ниже. Выбор из заглавных букв, строчных букв, цифр и знаков препинания. Можно выбрать или отменить выбор всех типов символов для этого столбца, щёлкнув на заголовок столбца.

source: Generate!
ru: Генерировать!

source: There is not enough characters available. Please add available characters on the right panel. Or uncheck the “Do not use duplicated characters” checkbox.
ru: Недостаточно доступных символов. Добавьте доступные символы на правой панели. Или снимите флажок “Не использовать повторяющиеся символы”.

source: Setting is invalid. At least 1 Character should be selected on each type (upper, lower, digit, punct)
ru: Неверная настройка. Для каждого симврла нужно выбрать не менее одного типа.

source: At least 1 check should be checked on each rows.
ru: В каждой строке должен быть установлен как минимум 1 флажок.

source: Character Setting
ru: Настройка символов

source: Here you can specify the characters used to generate the password. The pressed characters are used to generate the password. On the contrary, the characters that are not pressed are not used for password generation. At least one character should be pressed on each category.
ru: Здесь можно указать символы, используемые для генерации пароля. Будут использоваться только отмеченные символы. В каждой категории должен быть выбран хотя бы один символ.

source: Uppercase Letters
ru: Заглавные буквы

source: Lowercase Letters
ru: Строчные буквы

source: Digital characters
ru: Цифровые символы

source: Punctuation Characters
ru: Знаки препинания

source: Other Settings
ru: Другие настройки

source: Do not use duplicated characters
ru: Не использовать повторяющиеся символы

source: Failed to open random file. exit.
ru: Не удалось открыть случайный файл. Выход.

source: IOError: random_byte was failed (%s))
ru: IOError: ошибка случайного_байта (%s))
